"""
Дан pickle файл, содержащий единственную сериализованную функцию. 
Напишите программу, которая вызывает данную функцию с заданными аргументами и выводит возвращаемое значение функции.

Формат входных данных
На вход программе в первой строке подается название pickle файла, в котором содержится единственная сериализованная функция. 
Далее подается произвольное количество строк, каждая из которых содержит позиционный аргумент для этой функции.

Формат выходных данных
Программа должна вызвать функцию из указанного pickle файла со всеми введенными строковыми аргументами, 
и вывести возвращаемое значение функции. Причем аргументы должны быть переданы в том порядке, в котором они были введены.
"""

import pickle
import sys

name, *args = [i.strip() for i in sys.stdin]
with open(name, mode="rb") as function:
    res = pickle.load(function)

print(res(*args))